# YOLOv8 custom model with CAFMAttention integrated

nc: 1  # number of classes

scales:  # model compound scaling constants
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CAFMAttention, [256]]      # 👈 insert CAFMAttention after P3
  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]        # 8-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]           # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]          # cat backbone P4
  - [-1, 3, C2f, [512]]                # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]          # cat backbone P3
  - [-1, 3, C2f, [256]]                # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]         # cat head P4
  - [-1, 3, C2f, [512]]                # 19 (P4/16-medium)
  - [-1, 1, CAFMAttention, [512]]      # 👈 insert CAFMAttention in head

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]         # cat head P5
  - [-1, 3, C2f, [1024]]               # 22 (P5/32-large)

  - [[16, 20, 23], 1, Detect, [nc]]    # Detect(P3, P4, P5)
